(function () {
    WrittenNumber.registerLanguage("ar", {
            "useLongScale": false,
            "baseSeparator": "",
            "unitSeparator": "",
            "allSeparator": "و",
            "base": {
                    "0": "صفر",
                    "1": "واحد",
                    "2": "اثنان",
                    "3": "ثلاثة",
                    "4": "أربعة",
                    "5": "خمسة",
                    "6": "ستة",
                    "7": "سبعة",
                    "8": "ثمانية",
                    "9": "تسعة",
                    "10": "عشرة",
                    "11": "أحد عشر",
                    "12": "إثنا عشر",
                    "13": "ثلاثة عشر",
                    "14": "أربعة عشر",
                    "15": "خمسة عشر",
                    "16": "ستة عشر",
                    "17": "سبعة عشر",
                    "18": "ثمانية عشر",
                    "19": "تسعة عشر",
                    "20": "عشرون",
                    "21": "واحد وعشرون",
                    "22": "اثنان وعشرون",
                    "23": "ثلاثة وعشرون",
                    "24": "أربعة وعشرون",
                    "25": "خمسة وعشرون",
                    "26": "ستة وعشرون",
                    "27": "سبعة وعشرون",
                    "28": "ثمانية وعشرون",
                    "29": "تسعة وعشرون",
                    "30": "ثلاثون",
                    "31": "واحد وثلاثون",
                    "32": "اثنان وثلاثون",
                    "33": "ثلاثة وثلاثون",
                    "34": "أربعة وثلاثون",
                    "35": "خمسة وثلاثون",
                    "36": "ستة وثلاثون",
                    "37": "سبعة وثلاثون",
                    "38": "ثمانية وثلاثون",
                    "39": "تسعة وثلاثون",
                    "40": "أربعون",
                    "41": "واحد وأربعون",
                    "42": "اثنان وأربعون",
                    "43": "ثلاثة وأربعون",
                    "44": "أربعة وأربعون",
                    "45": "خمسة وأربعون",
                    "46": "ستة وأربعون",
                    "47": "سبعة وأربعون",
                    "48": "ثمانية وأربعون",
                    "49": "تسعة وأربعون",
                    "50": "خمسون",
                    "51": "واحد وخمسون",
                    "52": "اثنان وخمسون",
                    "53": "ثلاثة وخمسون",
                    "54": "أربعة وخمسون",
                    "55": "خمسة وخمسون",
                    "56": "ستة وخمسون",
                    "57": "سبعة وخمسون",
                    "58": "ثمانية وخمسون",
                    "59": "تسعة وخمسون",
                    "60": "ستون",
                    "61": "واحد وستون",
                    "62": "اثنان وستون",
                    "63": "ثلاثة وستون",
                    "64": "أربعة وستون",
                    "65": "خمسة وستون",
                    "66": "ستة وستون",
                    "67": "سبعة وستون",
                    "68": "ثمانية وستون",
                    "69": "تسعة وستون",
                    "70": "سبعون",
                    "71": "واحد وسبعون",
                    "72": "اثنان وسبعون",
                    "73": "ثلاثة وسبعون",
                    "74": "أربعة وسبعون",
                    "75": "خمسة وسبعون",
                    "76": "ستة وسبعون",
                    "77": "سبعة وسبعون",
                    "78": "ثمانية وسبعون",
                    "79": "تسعة وسبعون",
                    "80": "ثمانون",
                    "81": "واحد وثمانون",
                    "82": "اثنان وثمانون",
                    "83": "ثلاثة وثمانون",
                    "84": "أربعة وثمانون",
                    "85": "خمسة وثمانون",
                    "86": "ستة وثمانون",
                    "87": "سبعة وثمانون",
                    "88": "ثمانية وثمانون",
                    "89": "تسعة وثمانون",
                    "90": "تسعون",
                    "91": "واحد وتسعون",
                    "92": "اثنان وتسعون",
                    "93": "ثلاثة وتسعون",
                    "94": "أربعة وتسعون",
                    "95": "خمسة وتسعون",
                    "96": "ستة وتسعون",
                    "97": "سبعة وتسعون",
                    "98": "ثمانية وتسعون",
                    "99": "تسعة وتسعون",
                    "200": "مائتان",
                    "300": "ثلاثمائة",
                    "400": "أربعمائة",
                    "500": "خمسمائة",
                    "600": "ستمائة",
                    "700": "سبعمائة",
                    "800": "ثمانمائة",
                    "900": "تسعمائة"
            },
            "units": [
                    {
                            "useBaseInstead": true,
                            "useBaseException": [
                                    1
                            ],
                            "singular": "مائة"
                    },
                    {
                            "dual": "ألفان",
                            "plural": "آلاف",
                            "restrictedPlural": true,
                            "avoidPrefixException": [
                                    1,
                                    2
                            ],
                            "singular": "ألف"
                    },
                    {
                            "dual": "مليونان",
                            "plural": "ملايين",
                            "restrictedPlural": true,
                            "avoidPrefixException": [
                                    1,
                                    2
                            ],
                            "singular": "مليون"
                    },
                    {
                            "dual": "ملياران",
                            "plural": "ملايير",
                            "restrictedPlural": true,
                            "avoidPrefixException": [
                                    1,
                                    2
                            ],
                            "singular": "مليار"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "تريليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "كوادريليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "كوينتليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "سكستليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "سبتيلليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "أوكتيليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "نونيلليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "دشيليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "أوندشيلليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "دودشيليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "تريدشيليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "كواتوردشيليون"
                    },
                    {
                            "avoidPrefixException": [
                                    1
                            ],
                            "singular": "كويندشيليون"
                    }
            ]
    });
    WrittenNumber.registerCurrencies("ar", {
            "AED": {
                    "two": "درهم إماراتي",
                    "few": "درهم إماراتي",
                    "many": "درهم إماراتي",
                    "other": "درهم إماراتي"
            },
            "AFN": {
                    "two": "أفغاني أفغانستاني",
                    "few": "أفغاني أفغانستاني",
                    "many": "أفغاني أفغانستاني",
                    "other": "أفغاني أفغانستاني"
            },
            "ALL": {
                    "two": "ليك ألباني",
                    "few": "ليك ألباني",
                    "many": "ليك ألباني",
                    "other": "ليك ألباني"
            },
            "AMD": {
                    "two": "درام أرميني",
                    "few": "درام أرميني",
                    "many": "درام أرميني",
                    "other": "درام أرميني"
            },
            "ANG": {
                    "two": "غيلدر أنتيلي هولندي",
                    "few": "غيلدر أنتيلي هولندي",
                    "many": "غيلدر أنتيلي هولندي",
                    "other": "غيلدر أنتيلي هولندي"
            },
            "AOA": {
                    "two": "كوانزا أنغولي",
                    "few": "كوانزا أنغولي",
                    "many": "كوانزا أنغولي",
                    "other": "كوانزا أنغولي"
            },
            "ARS": {
                    "two": "بيزو أرجنتيني",
                    "few": "بيزو أرجنتيني",
                    "many": "بيزو أرجنتيني",
                    "other": "بيزو أرجنتيني"
            },
            "AUD": {
                    "two": "دولار أسترالي",
                    "few": "دولار أسترالي",
                    "many": "دولار أسترالي",
                    "other": "دولار أسترالي"
            },
            "AWG": {
                    "two": "فلورن أروبي",
                    "few": "فلورن أروبي",
                    "many": "فلورن أروبي",
                    "other": "فلورن أروبي"
            },
            "BAM": {
                    "two": "مارك البوسنة والهرسك قابل للتحويل",
                    "few": "مارك البوسنة والهرسك قابل للتحويل",
                    "many": "مارك البوسنة والهرسك قابل للتحويل",
                    "other": "مارك البوسنة والهرسك قابل للتحويل"
            },
            "BBD": {
                    "two": "دولار بربادوسي",
                    "few": "دولار بربادوسي",
                    "many": "دولار بربادوسي",
                    "other": "دولار بربادوسي"
            },
            "BDT": {
                    "two": "تاكا بنغلاديشي",
                    "few": "تاكا بنغلاديشي",
                    "many": "تاكا بنغلاديشي",
                    "other": "تاكا بنغلاديشي"
            },
            "BGN": {
                    "two": "ليف بلغاري",
                    "few": "ليف بلغاري",
                    "many": "ليف بلغاري",
                    "other": "ليف بلغاري"
            },
            "BHD": {
                    "two": "دينار بحريني",
                    "few": "دينار بحريني",
                    "many": "دينار بحريني",
                    "other": "دينار بحريني"
            },
            "BIF": {
                    "two": "فرنك بروندي",
                    "few": "فرنك بروندي",
                    "many": "فرنك بروندي",
                    "other": "فرنك بروندي"
            },
            "BMD": {
                    "two": "دولار برمودي",
                    "few": "دولار برمودي",
                    "many": "دولار برمودي",
                    "other": "دولار برمودي"
            },
            "BND": {
                    "two": "دولار بروناي",
                    "few": "دولار بروناي",
                    "many": "دولار بروناي",
                    "other": "دولار بروناي"
            },
            "BOB": {
                    "two": "بوليفيانو بوليفي",
                    "few": "بوليفيانو بوليفي",
                    "many": "بوليفيانو بوليفي",
                    "other": "بوليفيانو بوليفي"
            },
            "BRL": {
                    "two": "ريال برازيلي",
                    "few": "ريال برازيلي",
                    "many": "ريال برازيلي",
                    "other": "ريال برازيلي"
            },
            "BTN": {
                    "two": "نولتوم بوتاني",
                    "few": "نولتوم بوتاني",
                    "many": "نولتوم بوتاني",
                    "other": "نولتوم بوتاني"
            },
            "BWP": {
                    "two": "بولا بتسواني",
                    "few": "بولا بتسواني",
                    "many": "بولا بتسواني",
                    "other": "بولا بتسواني"
            },
            "BYN": {
                    "two": "روبل بيلاروسي",
                    "few": "روبل بيلاروسي",
                    "many": "روبل بيلاروسي",
                    "other": "روبل بيلاروسي"
            },
            "BZD": {
                    "two": "دولاران بليزيان",
                    "few": "دولار بليزي",
                    "many": "دولار بليزي",
                    "other": "دولار بليزي"
            },
            "CAD": {
                    "two": "دولار كندي",
                    "few": "دولار كندي",
                    "many": "دولار كندي",
                    "other": "دولار كندي"
            },
            "CDF": {
                    "two": "فرنك كونغولي",
                    "few": "فرنك كونغولي",
                    "many": "فرنك كونغولي",
                    "other": "فرنك كونغولي"
            },
            "CHF": {
                    "two": "فرنك سويسري",
                    "few": "فرنك سويسري",
                    "many": "فرنك سويسري",
                    "other": "فرنك سويسري"
            },
            "CNY": {
                    "two": "يوان صيني",
                    "few": "يوان صيني",
                    "many": "يوان صيني",
                    "other": "يوان صيني"
            },
            "COP": {
                    "two": "بيزو كولومبي",
                    "few": "بيزو كولومبي",
                    "many": "بيزو كولومبي",
                    "other": "بيزو كولومبي"
            },
            "CRC": {
                    "two": "كولن كوستاريكي",
                    "few": "كولن كوستاريكي",
                    "many": "كولن كوستاريكي",
                    "other": "كولن كوستاريكي"
            },
            "CUC": {
                    "two": "بيزو كوبي قابل للتحويل",
                    "few": "بيزو كوبي قابل للتحويل",
                    "many": "بيزو كوبي قابل للتحويل",
                    "other": "بيزو كوبي قابل للتحويل"
            },
            "CUP": {
                    "two": "بيزو كوبي",
                    "few": "بيزو كوبي",
                    "many": "بيزو كوبي",
                    "other": "بيزو كوبي"
            },
            "CVE": {
                    "two": "اسكودو الرأس الأخضر",
                    "few": "اسكودو الرأس الأخضر",
                    "many": "اسكودو الرأس الأخضر",
                    "other": "اسكودو الرأس الأخضر"
            },
            "CZK": {
                    "two": "كرونة تشيكية",
                    "few": "كرونة تشيكية",
                    "many": "كرونة تشيكية",
                    "other": "كرونة تشيكية"
            },
            "DJF": {
                    "two": "فرنك جيبوتي",
                    "few": "فرنك جيبوتي",
                    "many": "فرنك جيبوتي",
                    "other": "فرنك جيبوتي"
            },
            "DKK": {
                    "two": "كرونة دنماركية",
                    "few": "كرونة دنماركية",
                    "many": "كرونة دنماركية",
                    "other": "كرونة دنماركية"
            },
            "DOP": {
                    "two": "بيزو الدومنيكان",
                    "few": "بيزو الدومنيكان",
                    "many": "بيزو الدومنيكان",
                    "other": "بيزو الدومنيكان"
            },
            "DZD": {
                    "two": "ديناران جزائريان",
                    "few": "دينارات جزائرية",
                    "many": "دينارًا جزائريًا",
                    "other": "دينار جزائري"
            },
            "EGP": {
                    "two": "جنيهان مصريان",
                    "few": "جنيهات مصرية",
                    "many": "جنيهًا مصريًا",
                    "other": "جنيه مصري"
            },
            "ERN": {
                    "two": "ناكفا أريتري",
                    "few": "ناكفا أريتري",
                    "many": "ناكفا أريتري",
                    "other": "ناكفا أريتري"
            },
            "ETB": {
                    "two": "بير أثيوبي",
                    "few": "بير أثيوبي",
                    "many": "بير أثيوبي",
                    "other": "بير أثيوبي"
            },
            "EUR": {
                    "two": "يورو",
                    "few": "يورو",
                    "many": "يورو",
                    "other": "يورو"
            },
            "FJD": {
                    "two": "دولار فيجي",
                    "few": "دولار فيجي",
                    "many": "دولار فيجي",
                    "other": "دولار فيجي"
            },
            "FKP": {
                    "two": "جنيه جزر فوكلاند",
                    "few": "جنيه جزر فوكلاند",
                    "many": "جنيه جزر فوكلاند",
                    "other": "جنيه جزر فوكلاند"
            },
            "GBP": {
                    "two": "جنيه إسترليني",
                    "few": "جنيه إسترليني",
                    "many": "جنيه إسترليني",
                    "other": "جنيه إسترليني"
            },
            "GEL": {
                    "two": "لاري جورجي",
                    "few": "لاري جورجي",
                    "many": "لاري جورجي",
                    "other": "لاري جورجي"
            },
            "GHS": {
                    "two": "سيدي غانا",
                    "few": "سيدي غانا",
                    "many": "سيدي غانا",
                    "other": "سيدي غانا"
            },
            "GIP": {
                    "two": "جنيه جبل طارق",
                    "few": "جنيه جبل طارق",
                    "many": "جنيه جبل طارق",
                    "other": "جنيه جبل طارق"
            },
            "GMD": {
                    "two": "دلاسي غامبي",
                    "few": "دلاسي غامبي",
                    "many": "دلاسي غامبي",
                    "other": "دلاسي غامبي"
            },
            "GNF": {
                    "two": "فرنك غينيا",
                    "few": "فرنك غينيا",
                    "many": "فرنك غينيا",
                    "other": "فرنك غينيا"
            },
            "GTQ": {
                    "two": "كوتزال غواتيمالا",
                    "few": "كوتزال غواتيمالا",
                    "many": "كوتزال غواتيمالا",
                    "other": "كوتزال غواتيمالا"
            },
            "GYD": {
                    "two": "دولار غيانا",
                    "few": "دولار غيانا",
                    "many": "دولار غيانا",
                    "other": "دولار غيانا"
            },
            "HKD": {
                    "two": "دولار هونغ كونغ",
                    "few": "دولار هونغ كونغ",
                    "many": "دولار هونغ كونغ",
                    "other": "دولار هونغ كونغ"
            },
            "HNL": {
                    "two": "ليمبيرا هندوراس",
                    "few": "ليمبيرا هندوراس",
                    "many": "ليمبيرا هندوراس",
                    "other": "ليمبيرا هندوراس"
            },
            "HRK": {
                    "two": "كونا كرواتي",
                    "few": "كونا كرواتي",
                    "many": "كونا كرواتي",
                    "other": "كونا كرواتي"
            },
            "HTG": {
                    "two": "جوردى هايتي",
                    "few": "جوردى هايتي",
                    "many": "جوردى هايتي",
                    "other": "جوردى هايتي"
            },
            "HUF": {
                    "two": "فورينت هنغاري",
                    "few": "فورينت هنغاري",
                    "many": "فورينت هنغاري",
                    "other": "فورينت هنغاري"
            },
            "IDR": {
                    "two": "روبية إندونيسية",
                    "few": "روبية إندونيسية",
                    "many": "روبية إندونيسية",
                    "other": "روبية إندونيسية"
            },
            "ILS": {
                    "two": "شيكل إسرائيلي جديد",
                    "few": "شيكل إسرائيلي جديد",
                    "many": "شيكل إسرائيلي جديد",
                    "other": "شيكل إسرائيلي جديد"
            },
            "INR": {
                    "two": "روبية هندي",
                    "few": "روبية هندي",
                    "many": "روبية هندي",
                    "other": "روبية هندي"
            },
            "IQD": {
                    "two": "دينار عراقي",
                    "few": "دينار عراقي",
                    "many": "دينار عراقي",
                    "other": "دينار عراقي"
            },
            "IRR": {
                    "two": "ريال إيراني",
                    "few": "ريال إيراني",
                    "many": "ريال إيراني",
                    "other": "ريال إيراني"
            },
            "ISK": {
                    "two": "كرونة أيسلندية",
                    "few": "كرونة أيسلندية",
                    "many": "كرونة أيسلندية",
                    "other": "كرونة أيسلندية"
            },
            "JMD": {
                    "two": "دولار جامايكي",
                    "few": "دولار جامايكي",
                    "many": "دولار جامايكي",
                    "other": "دولار جامايكي"
            },
            "JOD": {
                    "two": "دينار أردني",
                    "few": "دينار أردني",
                    "many": "دينار أردني",
                    "other": "دينار أردني"
            },
            "JPY": {
                    "two": "ين ياباني",
                    "few": "ين ياباني",
                    "many": "ين ياباني",
                    "other": "ين ياباني"
            },
            "KES": {
                    "two": "شلن كينيي",
                    "few": "شلن كينيي",
                    "many": "شلن كينيي",
                    "other": "شلن كينيي"
            },
            "KGS": {
                    "two": "سوم قيرغستاني",
                    "few": "سوم قيرغستاني",
                    "many": "سوم قيرغستاني",
                    "other": "سوم قيرغستاني"
            },
            "KHR": {
                    "two": "رييال كمبودي",
                    "few": "رييال كمبودي",
                    "many": "رييال كمبودي",
                    "other": "رييال كمبودي"
            },
            "KMF": {
                    "two": "فرنك جزر القمر",
                    "few": "فرنك جزر القمر",
                    "many": "فرنك جزر القمر",
                    "other": "فرنك جزر القمر"
            },
            "KPW": {
                    "two": "وون كوريا الشمالية",
                    "few": "وون كوريا الشمالية",
                    "many": "وون كوريا الشمالية",
                    "other": "وون كوريا الشمالية"
            },
            "KRW": {
                    "two": "وون كوريا الجنوبية",
                    "few": "وون كوريا الجنوبية",
                    "many": "وون كوريا الجنوبية",
                    "other": "وون كوريا الجنوبية"
            },
            "KWD": {
                    "two": "دينار كويتي",
                    "few": "دينار كويتي",
                    "many": "دينار كويتي",
                    "other": "دينار كويتي"
            },
            "KYD": {
                    "two": "دولار جزر كيمن",
                    "few": "دولار جزر كيمن",
                    "many": "دولار جزر كيمن",
                    "other": "دولار جزر كيمن"
            },
            "KZT": {
                    "two": "تينغ كازاخستاني",
                    "few": "تينغ كازاخستاني",
                    "many": "تينغ كازاخستاني",
                    "other": "تينغ كازاخستاني"
            },
            "LAK": {
                    "two": "كيب لاوسي",
                    "few": "كيب لاوسي",
                    "many": "كيب لاوسي",
                    "other": "كيب لاوسي"
            },
            "LBP": {
                    "two": "جنيه لبناني",
                    "few": "جنيه لبناني",
                    "many": "جنيه لبناني",
                    "other": "جنيه لبناني"
            },
            "LKR": {
                    "two": "روبية سريلانكية",
                    "few": "روبية سريلانكية",
                    "many": "روبية سريلانكية",
                    "other": "روبية سريلانكية"
            },
            "LRD": {
                    "two": "دولاران ليبيريان",
                    "few": "دولارات ليبيرية",
                    "many": "دولارًا ليبيريًا",
                    "other": "دولار ليبيري"
            },
            "LSL": {
                    "two": "لوتي ليسوتو",
                    "few": "لوتي ليسوتو",
                    "many": "لوتي ليسوتو",
                    "other": "لوتي ليسوتو"
            },
            "LYD": {
                    "two": "ديناران ليبيان",
                    "few": "دينارات ليبية",
                    "many": "دينارًا ليبيًا",
                    "other": "دينار ليبي"
            },
            "MAD": {
                    "two": "درهمان مغربيان",
                    "few": "دراهم مغربية",
                    "many": "درهمًا مغربيًا",
                    "other": "درهم مغربي"
            },
            "MDL": {
                    "two": "ليو مولدوفي",
                    "few": "ليو مولدوفي",
                    "many": "ليو مولدوفي",
                    "other": "ليو مولدوفي"
            },
            "MGA": {
                    "two": "أرياري مدغشقر",
                    "few": "أرياري مدغشقر",
                    "many": "أرياري مدغشقر",
                    "other": "أرياري مدغشقر"
            },
            "MKD": {
                    "two": "ديناران مقدونيان",
                    "few": "دينارات مقدونية",
                    "many": "دينارًا مقدونيًا",
                    "other": "دينار مقدوني"
            },
            "MMK": {
                    "two": "كيات ميانمار",
                    "few": "كيات ميانمار",
                    "many": "كيات ميانمار",
                    "other": "كيات ميانمار"
            },
            "MNT": {
                    "two": "توغروغ منغولي",
                    "few": "توغروغ منغولي",
                    "many": "توغروغ منغولي",
                    "other": "توغروغ منغولي"
            },
            "MOP": {
                    "two": "باتاكا ماكاوي",
                    "few": "باتاكا ماكاوي",
                    "many": "باتاكا ماكاوي",
                    "other": "باتاكا ماكاوي"
            },
            "MRU": {
                    "two": "أوقية موريتانية",
                    "few": "أوقية موريتانية",
                    "many": "أوقية موريتانية",
                    "other": "أوقية موريتانية"
            },
            "MUR": {
                    "two": "روبية موريشيوسية",
                    "few": "روبية موريشيوسية",
                    "many": "روبية موريشيوسية",
                    "other": "روبية موريشيوسية"
            },
            "MVR": {
                    "two": "روفيه جزر المالديف",
                    "few": "روفيه جزر المالديف",
                    "many": "روفيه جزر المالديف",
                    "other": "روفيه جزر المالديف"
            },
            "MWK": {
                    "two": "كواشا مالاوي",
                    "few": "كواشا مالاوي",
                    "many": "كواشا مالاوي",
                    "other": "كواشا مالاوي"
            },
            "MXN": {
                    "two": "بيزو مكسيكي",
                    "few": "بيزو مكسيكي",
                    "many": "بيزو مكسيكي",
                    "other": "بيزو مكسيكي"
            },
            "MYR": {
                    "two": "رينغيت ماليزي",
                    "few": "رينغيت ماليزي",
                    "many": "رينغيت ماليزي",
                    "other": "رينغيت ماليزي"
            },
            "MZN": {
                    "two": "متكال موزمبيقي",
                    "few": "متكال موزمبيقي",
                    "many": "متكال موزمبيقي",
                    "other": "متكال موزمبيقي"
            },
            "NAD": {
                    "two": "دولار ناميبي",
                    "few": "دولار ناميبي",
                    "many": "دولار ناميبي",
                    "other": "دولار ناميبي"
            },
            "NGN": {
                    "two": "نايرا نيجيري",
                    "few": "نايرا نيجيري",
                    "many": "نايرا نيجيري",
                    "other": "نايرا نيجيري"
            },
            "NIO": {
                    "two": "قرطبة نيكاراغوا",
                    "few": "قرطبة نيكاراغوا",
                    "many": "قرطبة نيكاراغوا",
                    "other": "قرطبة نيكاراغوا"
            },
            "NOK": {
                    "two": "كرونة نرويجية",
                    "few": "كرونة نرويجية",
                    "many": "كرونة نرويجية",
                    "other": "كرونة نرويجية"
            },
            "NPR": {
                    "two": "روبية نيبالي",
                    "few": "روبية نيبالي",
                    "many": "روبية نيبالي",
                    "other": "روبية نيبالي"
            },
            "NZD": {
                    "two": "دولار نيوزيلندي",
                    "few": "دولار نيوزيلندي",
                    "many": "دولار نيوزيلندي",
                    "other": "دولار نيوزيلندي"
            },
            "OMR": {
                    "two": "ريال عماني",
                    "few": "ريال عماني",
                    "many": "ريال عماني",
                    "other": "ريال عماني"
            },
            "PAB": {
                    "two": "بالبوا بنمي",
                    "few": "بالبوا بنمي",
                    "many": "بالبوا بنمي",
                    "other": "بالبوا بنمي"
            },
            "PEN": {
                    "two": "سول بيروفي",
                    "few": "سول بيروفي",
                    "many": "سول بيروفي",
                    "other": "سول بيروفي"
            },
            "PGK": {
                    "two": "كينا بابوا غينيا الجديدة",
                    "few": "كينا بابوا غينيا الجديدة",
                    "many": "كينا بابوا غينيا الجديدة",
                    "other": "كينا بابوا غينيا الجديدة"
            },
            "PHP": {
                    "two": "بيزو فلبيني",
                    "few": "بيزو فلبيني",
                    "many": "بيزو فلبيني",
                    "other": "بيزو فلبيني"
            },
            "PKR": {
                    "two": "روبية باكستاني",
                    "few": "روبية باكستاني",
                    "many": "روبية باكستاني",
                    "other": "روبية باكستاني"
            },
            "PLN": {
                    "two": "زلوتي بولندي",
                    "few": "زلوتي بولندي",
                    "many": "زلوتي بولندي",
                    "other": "زلوتي بولندي"
            },
            "PYG": {
                    "two": "غواراني باراغواي",
                    "few": "غواراني باراغواي",
                    "many": "غواراني باراغواي",
                    "other": "غواراني باراغواي"
            },
            "QAR": {
                    "two": "ريال قطري",
                    "few": "ريال قطري",
                    "many": "ريال قطري",
                    "other": "ريال قطري"
            },
            "RON": {
                    "two": "ليو روماني",
                    "few": "ليو روماني",
                    "many": "ليو روماني",
                    "other": "ليو روماني"
            },
            "RSD": {
                    "two": "ديناران صربيان",
                    "few": "دينارات صربية",
                    "many": "دينارًا صربيًا",
                    "other": "دينار صربي"
            },
            "RUB": {
                    "two": "روبل روسي",
                    "few": "روبل روسي",
                    "many": "روبل روسي",
                    "other": "روبل روسي"
            },
            "RWF": {
                    "two": "فرنك رواندي",
                    "few": "فرنك رواندي",
                    "many": "فرنك رواندي",
                    "other": "فرنك رواندي"
            },
            "SAR": {
                    "two": "ريال سعودي",
                    "few": "ريال سعودي",
                    "many": "ريال سعودي",
                    "other": "ريال سعودي"
            },
            "SBD": {
                    "two": "دولار جزر سليمان",
                    "few": "دولار جزر سليمان",
                    "many": "دولار جزر سليمان",
                    "other": "دولار جزر سليمان"
            },
            "SCR": {
                    "two": "روبية سيشيلية",
                    "few": "روبية سيشيلية",
                    "many": "روبية سيشيلية",
                    "other": "روبية سيشيلية"
            },
            "SDG": {
                    "two": "جنيه سوداني",
                    "few": "جنيهات سودانية",
                    "many": "جنيهًا سودانيًا",
                    "other": "جنيه سوداني"
            },
            "SEK": {
                    "two": "كرونة سويدية",
                    "few": "كرونة سويدية",
                    "many": "كرونة سويدية",
                    "other": "كرونة سويدية"
            },
            "SGD": {
                    "two": "دولار سنغافوري",
                    "few": "دولار سنغافوري",
                    "many": "دولار سنغافوري",
                    "other": "دولار سنغافوري"
            },
            "SHP": {
                    "two": "جنيه سانت هيلين",
                    "few": "جنيه سانت هيلين",
                    "many": "جنيه سانت هيلين",
                    "other": "جنيه سانت هيلين"
            },
            "SLL": {
                    "two": "ليون سيراليوني",
                    "few": "ليون سيراليوني",
                    "many": "ليون سيراليوني",
                    "other": "ليون سيراليوني"
            },
            "SOS": {
                    "two": "شلن صومالي",
                    "few": "شلن صومالي",
                    "many": "شلن صومالي",
                    "other": "شلن صومالي"
            },
            "SRD": {
                    "two": "دولار سورينامي",
                    "few": "دولار سورينامي",
                    "many": "دولار سورينامي",
                    "other": "دولار سورينامي"
            },
            "SSP": {
                    "two": "جنيهان جنوب السودان",
                    "few": "جنيهات جنوب السودان",
                    "many": "جنيهًا جنوب السودان",
                    "other": "جنيه جنوب السودان"
            },
            "STN": {
                    "two": "دوبرا ساو تومي وبرينسيبي",
                    "few": "دوبرا ساو تومي وبرينسيبي",
                    "many": "دوبرا ساو تومي وبرينسيبي",
                    "other": "دوبرا ساو تومي وبرينسيبي"
            },
            "SYP": {
                    "two": "ليرة سورية",
                    "few": "ليرة سورية",
                    "many": "ليرة سورية",
                    "other": "ليرة سورية"
            },
            "SZL": {
                    "two": "ليلانجيني سوازيلندي",
                    "few": "ليلانجيني سوازيلندي",
                    "many": "ليلانجيني سوازيلندي",
                    "other": "ليلانجيني سوازيلندي"
            },
            "THB": {
                    "two": "باخت تايلاندي",
                    "few": "باخت تايلاندي",
                    "many": "باخت تايلاندي",
                    "other": "باخت تايلاندي"
            },
            "TJS": {
                    "two": "سوموني طاجيكستاني",
                    "few": "سوموني طاجيكستاني",
                    "many": "سوموني طاجيكستاني",
                    "other": "سوموني طاجيكستاني"
            },
            "TMT": {
                    "two": "مانات تركمانستان",
                    "few": "مانات تركمانستان",
                    "many": "مانات تركمانستان",
                    "other": "مانات تركمانستان"
            },
            "TND": {
                    "two": "ديناران تونسيان",
                    "few": "دينارات تونسية",
                    "many": "دينارًا تونسيًا",
                    "other": "دينار تونسي"
            },
            "TOP": {
                    "two": "بانغا تونغا",
                    "few": "بانغا تونغا",
                    "many": "بانغا تونغا",
                    "other": "بانغا تونغا"
            },
            "TRY": {
                    "two": "ليرة تركية",
                    "few": "ليرة تركية",
                    "many": "ليرة تركية",
                    "other": "ليرة تركية"
            },
            "TTD": {
                    "two": "دولار ترينداد وتوباغو",
                    "few": "دولار ترينداد وتوباغو",
                    "many": "دولار ترينداد وتوباغو",
                    "other": "دولار ترينداد وتوباغو"
            },
            "TWD": {
                    "two": "دولار تايواني",
                    "few": "دولار تايواني",
                    "many": "دولار تايواني",
                    "other": "دولار تايواني"
            },
            "TZS": {
                    "two": "شلن تنزاني",
                    "few": "شلن تنزاني",
                    "many": "شلن تنزاني",
                    "other": "شلن تنزاني"
            },
            "UAH": {
                    "two": "هريفنيا أوكراني",
                    "few": "هريفنيا أوكراني",
                    "many": "هريفنيا أوكراني",
                    "other": "هريفنيا أوكراني"
            },
            "UGX": {
                    "two": "شلن أوغندي",
                    "few": "شلن أوغندي",
                    "many": "شلن أوغندي",
                    "other": "شلن أوغندي"
            },
            "USD": {
                    "two": "دولار أمريكي",
                    "few": "دولار أمريكي",
                    "many": "دولار أمريكي",
                    "other": "دولار أمريكي"
            },
            "UYU": {
                    "two": "بيزو اوروغواي",
                    "few": "بيزو اوروغواي",
                    "many": "بيزو اوروغواي",
                    "other": "بيزو اوروغواي"
            },
            "UZS": {
                    "two": "سوم أوزبكستاني",
                    "few": "سوم أوزبكستاني",
                    "many": "سوم أوزبكستاني",
                    "other": "سوم أوزبكستاني"
            },
            "VES": {
                    "two": "بوليفار فنزويلي",
                    "few": "بوليفار فنزويلي",
                    "many": "بوليفار فنزويلي",
                    "other": "بوليفار فنزويلي"
            },
            "VND": {
                    "two": "دونج فيتنامي",
                    "few": "دونج فيتنامي",
                    "many": "دونج فيتنامي",
                    "other": "دونج فيتنامي"
            },
            "VUV": {
                    "two": "فاتو فانواتو",
                    "few": "فاتو فانواتو",
                    "many": "فاتو فانواتو",
                    "other": "فاتو فانواتو"
            },
            "WST": {
                    "two": "تالا ساموا",
                    "few": "تالا ساموا",
                    "many": "تالا ساموا",
                    "other": "تالا ساموا"
            },
            "XAF": {
                    "two": "فرنك وسط أفريقي",
                    "few": "فرنك وسط أفريقي",
                    "many": "فرنك وسط أفريقي",
                    "other": "فرنك وسط أفريقي"
            },
            "XCD": {
                    "two": "دولار شرق الكاريبي",
                    "few": "دولار شرق الكاريبي",
                    "many": "دولار شرق الكاريبي",
                    "other": "دولار شرق الكاريبي"
            },
            "XOF": {
                    "two": "فرنك غرب أفريقي",
                    "few": "فرنك غرب أفريقي",
                    "many": "فرنك غرب أفريقي",
                    "other": "فرنك غرب أفريقي"
            },
            "XPF": {
                    "two": "فرنك سي إف بي",
                    "few": "فرنك سي إف بي",
                    "many": "فرنك سي إف بي",
                    "other": "فرنك سي إف بي"
            },
            "YER": {
                    "two": "ريال يمني",
                    "few": "ريال يمني",
                    "many": "ريال يمني",
                    "other": "ريال يمني"
            },
            "ZAR": {
                    "two": "راند جنوب أفريقيا",
                    "few": "راند جنوب أفريقيا",
                    "many": "راند جنوب أفريقيا",
                    "other": "راند جنوب أفريقيا"
            },
            "ZMW": {
                    "two": "كواشا زامبي",
                    "few": "كواشا زامبي",
                    "many": "كواشا زامبي",
                    "other": "كواشا زامبي"
            }
    });
})();
