(function () {
    WrittenNumber.registerLanguage("ru", {
        "useLongScale": false,
        "baseSeparator": " ",
        "unitSeparator": "",
        "base": {
            "0": "ноль",
            "1": "один",
            "2": "два",
            "3": "три",
            "4": "четыре",
            "5": "пять",
            "6": "шесть",
            "7": "семь",
            "8": "восемь",
            "9": "девять",
            "10": "десять",
            "11": "одинадцать",
            "12": "двенадцать",
            "13": "тринадцать",
            "14": "четырнадцать",
            "15": "пятнадцать",
            "16": "шестнадцать",
            "17": "семнадцать",
            "18": "восемнадцать",
            "19": "девятнадцать",
            "20": "двадцать",
            "30": "тридцать",
            "40": "сорок",
            "50": "пятьдесят",
            "60": "шестьдесят",
            "70": "семьдесят",
            "80": "восемьдесят",
            "90": "девяносто",
            "100": "сто",
            "200": "двести",
            "300": "триста",
            "400": "четыреста",
            "500": "пятьсот",
            "600": "шестьсот",
            "700": "семьсот",
            "800": "восемьсот",
            "900": "девятьсот"
        },
        "units": [
            {
                "useBaseInstead": true,
                "useBaseException": []
            },
            {
                "few": "тысячи",
                "plural": "тысяч",
                "alternativeBase": {
                    "1": "одна",
                    "2": "дві"
                },
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "тысяча"
            },
            {
                "few": "миллиона",
                "plural": "миллионов",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "миллион"
            },
            {
                "few": "миллиарда",
                "plural": "миллиардов",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "миллиард"
            },
            {
                "few": "триллиона",
                "plural": "триллионов",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "триллион"
            },
            {
                "few": "квадриллион",
                "plural": "квадрилон",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "квадрильон"
            },
            {
                "few": "секстильона",
                "plural": "секстиллионов",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "секстиллионов"
            },
            {
                "few": "септиллиона",
                "plural": "септиллионов",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "септиллион"
            },
            {
                "few": "октиллиона",
                "plural": "октиллионов",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "октиллион"
            },
            {
                "few": "нониллиона",
                "plural": "нониллионов",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "нониллион"
            },
            {
                "few": "дециллиона",
                "plural": "дециллионов",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "дециллион"
            },
            {
                "few": "ундециллиона",
                "plural": "ундециллионив",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "ундециллион"
            },
            {
                "few": "дуодециллиона",
                "plural": "дуодециллионив",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "дуодециллион"
            },
            {
                "few": "тредециллиона",
                "plural": "тредециллионив",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "тредециллион"
            },
            {
                "few": "кватуордециллиона",
                "plural": "кватуордециллионив",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "кватуордециллион"
            },
            {
                "few": "квиндециллиона",
                "plural": "квиндециллионив",
                "useSingularEnding": true,
                "useFewEnding": true,
                "avoidEndingRules": [
                    11,
                    12,
                    13,
                    14,
                    111,
                    112,
                    113,
                    114,
                    211,
                    212,
                    213,
                    214,
                    311,
                    312,
                    313,
                    314,
                    411,
                    412,
                    413,
                    414,
                    511,
                    512,
                    513,
                    514,
                    611,
                    612,
                    613,
                    614,
                    711,
                    712,
                    713,
                    714,
                    811,
                    812,
                    813,
                    814,
                    911,
                    912,
                    913,
                    914
                ],
                "singular": "квиндециллион"
            }
        ],
        "unitExceptions": {}
    });
    WrittenNumber.registerCurrencies("ru", {
        "AED": {
            "one": "дирхам ОАЭ",
            "few": "дирхама ОАЭ",
            "many": "дирхамов ОАЭ",
            "other": "дирхама ОАЭ"
        },
        "AFN": {
            "few": "афгани",
            "many": "афгани",
            "other": "афгани"
        },
        "ALL": {
            "one": "албанский лек",
            "few": "албанских лека",
            "many": "албанских леков",
            "other": "албанского лека"
        },
        "AMD": {
            "one": "армянский драм",
            "few": "армянских драма",
            "many": "армянских драмов",
            "other": "армянского драма"
        },
        "ANG": {
            "one": "нидерландский антильский гульден",
            "few": "нидерландских антильских гульдена",
            "many": "нидерландских антильских гульденов",
            "other": "нидерландского антильского гульдена"
        },
        "AOA": {
            "one": "ангольская кванза",
            "few": "ангольские кванзы",
            "many": "ангольских кванз",
            "other": "ангольской кванзы"
        },
        "ARS": {
            "one": "аргентинский песо",
            "few": "аргентинских песо",
            "many": "аргентинских песо",
            "other": "аргентинского песо"
        },
        "AUD": {
            "one": "австралийский доллар",
            "few": "австралийских доллара",
            "many": "австралийских долларов",
            "other": "австралийского доллара"
        },
        "AWG": {
            "one": "арубанский флорин",
            "few": "арубанских флорина",
            "many": "арубанских флоринов",
            "other": "арубанского флорина"
        },
        "BAM": {
            "one": "конвертируемая марка Боснии и Герцеговины",
            "few": "конвертируемые марки Боснии и Герцеговины",
            "many": "конвертируемых марок Боснии и Герцеговины",
            "other": "конвертируемой марки Боснии и Герцеговины"
        },
        "BBD": {
            "one": "барбадосский доллар",
            "few": "барбадосских доллара",
            "many": "барбадосских долларов",
            "other": "барбадосского доллара"
        },
        "BDT": {
            "one": "бангладешская така",
            "few": "бангладешские таки",
            "many": "бангладешских так",
            "other": "бангладешской таки"
        },
        "BGN": {
            "one": "болгарский лев",
            "few": "болгарских лева",
            "many": "болгарских левов",
            "other": "болгарского лева"
        },
        "BHD": {
            "one": "бахрейнский динар",
            "few": "бахрейнских динара",
            "many": "бахрейнских динаров",
            "other": "бахрейнского динара"
        },
        "BIF": {
            "one": "бурундийский франк",
            "few": "бурундийских франка",
            "many": "бурундийских франков",
            "other": "бурундийского франка"
        },
        "BMD": {
            "one": "бермудский доллар",
            "few": "бермудских доллара",
            "many": "бермудских долларов",
            "other": "бермудского доллара"
        },
        "BND": {
            "one": "брунейский доллар",
            "few": "брунейских доллара",
            "many": "брунейских долларов",
            "other": "брунейского доллара"
        },
        "BOB": {
            "one": "боливийский боливиано",
            "few": "боливийских боливиано",
            "many": "боливийских боливиано",
            "other": "боливийского боливиано"
        },
        "BRL": {
            "one": "бразильский реал",
            "few": "бразильских реала",
            "many": "бразильских реалов",
            "other": "бразильского реала"
        },
        "BTN": {
            "one": "бутанский нгултрум",
            "few": "бутанских нгултрума",
            "many": "бутанских нгултрумов",
            "other": "бутанского нгултрума"
        },
        "BWP": {
            "one": "ботсванская пула",
            "few": "ботсванские пулы",
            "many": "ботсванских пул",
            "other": "ботсванской пулы"
        },
        "BYN": {
            "one": "белорусский рубль",
            "few": "белорусских рубля",
            "many": "белорусских рублей",
            "other": "белорусского рубля"
        },
        "BZD": {
            "one": "белизский доллар",
            "few": "белизских доллара",
            "many": "белизских долларов",
            "other": "белизского доллара"
        },
        "CAD": {
            "one": "канадский доллар",
            "few": "канадских доллара",
            "many": "канадских долларов",
            "other": "канадского доллара"
        },
        "CDF": {
            "one": "конголезский франк",
            "few": "конголезских франка",
            "many": "конголезских франков",
            "other": "конголезского франка"
        },
        "CHF": {
            "one": "швейцарский франк",
            "few": "швейцарских франка",
            "many": "швейцарских франков",
            "other": "швейцарского франка"
        },
        "CNY": {
            "one": "китайский юань",
            "few": "китайских юаня",
            "many": "китайских юаней",
            "other": "китайского юаня"
        },
        "COP": {
            "one": "колумбийский песо",
            "few": "колумбийских песо",
            "many": "колумбийских песо",
            "other": "колумбийского песо"
        },
        "CRC": {
            "one": "костариканский колон",
            "few": "костариканских колона",
            "many": "костариканских колонов",
            "other": "костариканского колона"
        },
        "CUC": {
            "one": "кубинский конвертируемый песо",
            "few": "кубинских конвертируемых песо",
            "many": "кубинских конвертируемых песо",
            "other": "кубинского конвертируемого песо"
        },
        "CUP": {
            "one": "кубинский песо",
            "few": "кубинских песо",
            "many": "кубинских песо",
            "other": "кубинского песо"
        },
        "CVE": {
            "few": "эскудо Кабо-Верде",
            "many": "эскудо Кабо-Верде",
            "other": "эскудо Кабо-Верде"
        },
        "CZK": {
            "one": "чешская крона",
            "few": "чешские кроны",
            "many": "чешских крон",
            "other": "чешской кроны"
        },
        "DJF": {
            "one": "франк Джибути",
            "few": "франка Джибути",
            "many": "франков Джибути",
            "other": "франка Джибути"
        },
        "DKK": {
            "one": "датская крона",
            "few": "датские кроны",
            "many": "датских крон",
            "other": "датской кроны"
        },
        "DOP": {
            "one": "доминиканский песо",
            "few": "доминиканских песо",
            "many": "доминиканских песо",
            "other": "доминиканского песо"
        },
        "DZD": {
            "one": "алжирский динар",
            "few": "алжирских динара",
            "many": "алжирских динаров",
            "other": "алжирского динара"
        },
        "EGP": {
            "one": "египетский фунт",
            "few": "египетских фунта",
            "many": "египетских фунтов",
            "other": "египетского фунта"
        },
        "ERN": {
            "one": "эритрейская накфа",
            "few": "эритрейские накфы",
            "many": "эритрейских накф",
            "other": "эритрейской накфы"
        },
        "ETB": {
            "one": "эфиопский быр",
            "few": "эфиопских быра",
            "many": "эфиопских быров",
            "other": "эфиопского быра"
        },
        "EUR": {
            "few": "евро",
            "many": "евро",
            "other": "евро"
        },
        "FJD": {
            "one": "доллар Фиджи",
            "few": "доллара Фиджи",
            "many": "долларов Фиджи",
            "other": "доллара Фиджи"
        },
        "FKP": {
            "one": "фунт Фолклендских островов",
            "few": "фунта Фолклендских островов",
            "many": "фунтов Фолклендских островов",
            "other": "фунта Фолклендских островов"
        },
        "GBP": {
            "one": "британский фунт стерлингов",
            "few": "британских фунта стерлингов",
            "many": "британских фунтов стерлингов",
            "other": "британского фунта стерлингов"
        },
        "GEL": {
            "one": "грузинский лари",
            "few": "грузинских лари",
            "many": "грузинских лари",
            "other": "грузинского лари"
        },
        "GHS": {
            "one": "ганский седи",
            "few": "ганских седи",
            "many": "ганских седи",
            "other": "ганского седи"
        },
        "GIP": {
            "one": "гибралтарский фунт",
            "few": "гибралтарских фунта",
            "many": "гибралтарских фунтов",
            "other": "гибралтарского фунта"
        },
        "GMD": {
            "one": "гамбийский даласи",
            "few": "гамбийских даласи",
            "many": "гамбийских даласи",
            "other": "гамбийского даласи"
        },
        "GNF": {
            "one": "гвинейский франк",
            "few": "гвинейских франка",
            "many": "гвинейских франков",
            "other": "гвинейского франка"
        },
        "GTQ": {
            "one": "гватемальский кетсаль",
            "few": "гватемальских кетсаля",
            "many": "гватемальских кетсалей",
            "other": "гватемальского кетсаля"
        },
        "GYD": {
            "one": "гайанский доллар",
            "few": "гайанских доллара",
            "many": "гайанских долларов",
            "other": "гайанского доллара"
        },
        "HKD": {
            "one": "гонконгский доллар",
            "few": "гонконгских доллара",
            "many": "гонконгских долларов",
            "other": "гонконгского доллара"
        },
        "HNL": {
            "one": "гондурасская лемпира",
            "few": "гондурасские лемпиры",
            "many": "гондурасских лемпир",
            "other": "гондурасской лемпиры"
        },
        "HRK": {
            "one": "хорватская куна",
            "few": "хорватские куны",
            "many": "хорватских кун",
            "other": "хорватской куны"
        },
        "HTG": {
            "one": "гаитянский гурд",
            "few": "гаитянских гурда",
            "many": "гаитянских гурдов",
            "other": "гаитянского гурда"
        },
        "HUF": {
            "one": "венгерский форинт",
            "few": "венгерских форинта",
            "many": "венгерских форинтов",
            "other": "венгерского форинта"
        },
        "IDR": {
            "one": "индонезийская рупия",
            "few": "индонезийские рупии",
            "many": "индонезийских рупий",
            "other": "индонезийской рупии"
        },
        "ILS": {
            "one": "новый израильский шекель",
            "few": "новых израильских шекеля",
            "many": "новых израильских шекелей",
            "other": "нового израильского шекеля"
        },
        "INR": {
            "one": "индийская рупия",
            "few": "индийские рупии",
            "many": "индийских рупий",
            "other": "индийской рупии"
        },
        "IQD": {
            "one": "иракский динар",
            "few": "иракских динара",
            "many": "иракских динаров",
            "other": "иракского динара"
        },
        "IRR": {
            "one": "иранский риал",
            "few": "иранских риала",
            "many": "иранских риалов",
            "other": "иранского риала"
        },
        "ISK": {
            "one": "исландская крона",
            "few": "исландские кроны",
            "many": "исландских крон",
            "other": "исландской кроны"
        },
        "JMD": {
            "one": "ямайский доллар",
            "few": "ямайских доллара",
            "many": "ямайских долларов",
            "other": "ямайского доллара"
        },
        "JOD": {
            "one": "иорданский динар",
            "few": "иорданских динара",
            "many": "иорданских динаров",
            "other": "иорданского динара"
        },
        "JPY": {
            "one": "японская иена",
            "few": "японские иены",
            "many": "японских иен",
            "other": "японской иены"
        },
        "KES": {
            "one": "кенийский шиллинг",
            "few": "кенийских шиллинга",
            "many": "кенийских шиллингов",
            "other": "кенийского шиллинга"
        },
        "KGS": {
            "one": "киргизский сом",
            "few": "киргизских сома",
            "many": "киргизских сомов",
            "other": "киргизского сома"
        },
        "KHR": {
            "one": "камбоджийский риель",
            "few": "камбоджийских риеля",
            "many": "камбоджийских риелей",
            "other": "камбоджийского риеля"
        },
        "KMF": {
            "one": "коморский франк",
            "few": "коморских франка",
            "many": "коморских франков",
            "other": "коморского франка"
        },
        "KPW": {
            "one": "северокорейская вона",
            "few": "северокорейские воны",
            "many": "северокорейских вон",
            "other": "северокорейской воны"
        },
        "KRW": {
            "one": "южнокорейская вона",
            "few": "южнокорейские воны",
            "many": "южнокорейских вон",
            "other": "южнокорейской воны"
        },
        "KWD": {
            "one": "кувейтский динар",
            "few": "кувейтских динара",
            "many": "кувейтских динаров",
            "other": "кувейтского динара"
        },
        "KYD": {
            "one": "доллар Островов Кайман",
            "few": "доллара Островов Кайман",
            "many": "долларов Островов Кайман",
            "other": "доллара Островов Кайман"
        },
        "KZT": {
            "one": "казахский тенге",
            "few": "казахских тенге",
            "many": "казахских тенге",
            "other": "казахского тенге"
        },
        "LAK": {
            "one": "лаосский кип",
            "few": "лаосских кипа",
            "many": "лаосских кипов",
            "other": "лаосского кипа"
        },
        "LBP": {
            "one": "ливанский фунт",
            "few": "ливанских фунта",
            "many": "ливанских фунтов",
            "other": "ливанского фунта"
        },
        "LKR": {
            "one": "шри-ланкийская рупия",
            "few": "шри-ланкийские рупии",
            "many": "шри-ланкийских рупий",
            "other": "шри-ланкийской рупии"
        },
        "LRD": {
            "one": "либерийский доллар",
            "few": "либерийских доллара",
            "many": "либерийских долларов",
            "other": "либерийского доллара"
        },
        "LSL": {
            "few": "лоти",
            "many": "лоти",
            "other": "лоти"
        },
        "LYD": {
            "one": "ливийский динар",
            "few": "ливийских динара",
            "many": "ливийских динаров",
            "other": "ливийского динара"
        },
        "MAD": {
            "one": "марокканский дирхам",
            "few": "марокканских дирхама",
            "many": "марокканских дирхамов",
            "other": "марокканского дирхама"
        },
        "MDL": {
            "one": "молдавский лей",
            "few": "молдавских лея",
            "many": "молдавских леев",
            "other": "молдавского лея"
        },
        "MGA": {
            "one": "малагасийский ариари",
            "few": "малагасийских ариари",
            "many": "малагасийских ариари",
            "other": "малагасийского ариари"
        },
        "MKD": {
            "one": "македонский денар",
            "few": "македонских денара",
            "many": "македонских денаров",
            "other": "македонского денара"
        },
        "MMK": {
            "one": "мьянманский кьят",
            "few": "мьянманских кьята",
            "many": "мьянманских кьятов",
            "other": "мьянманского кьята"
        },
        "MNT": {
            "one": "монгольский тугрик",
            "few": "монгольских тугрика",
            "many": "монгольских тугриков",
            "other": "монгольского тугрика"
        },
        "MOP": {
            "one": "патака Макао",
            "few": "патаки Макао",
            "many": "патак Макао",
            "other": "патаки Макао"
        },
        "MRU": {
            "one": "мавританская угия",
            "few": "мавританские угии",
            "many": "мавританских угий",
            "other": "мавританской угии"
        },
        "MUR": {
            "one": "маврикийская рупия",
            "few": "маврикийские рупии",
            "many": "маврикийских рупий",
            "other": "маврикийской рупии"
        },
        "MVR": {
            "one": "мальдивская руфия",
            "few": "мальдивские руфии",
            "many": "мальдивских руфий",
            "other": "мальдивской руфии"
        },
        "MWK": {
            "one": "малавийская квача",
            "few": "малавийские квачи",
            "many": "малавийских квач",
            "other": "малавийской квачи"
        },
        "MXN": {
            "one": "мексиканский песо",
            "few": "мексиканских песо",
            "many": "мексиканских песо",
            "other": "мексиканского песо"
        },
        "MYR": {
            "one": "малайзийский ринггит",
            "few": "малайзийских ринггита",
            "many": "малайзийских ринггитов",
            "other": "малайзийского ринггита"
        },
        "MZN": {
            "one": "мозамбикский метикал",
            "few": "мозамбикских метикала",
            "many": "мозамбикских метикалов",
            "other": "мозамбикского метикала"
        },
        "NAD": {
            "one": "доллар Намибии",
            "few": "доллара Намибии",
            "many": "долларов Намибии",
            "other": "доллара Намибии"
        },
        "NGN": {
            "one": "нигерийская найра",
            "few": "нигерийские найры",
            "many": "нигерийских найр",
            "other": "нигерийской найры"
        },
        "NIO": {
            "one": "никарагуанская кордоба",
            "few": "никарагуанские кордобы",
            "many": "никарагуанских кордоб",
            "other": "никарагуанской кордобы"
        },
        "NOK": {
            "one": "норвежская крона",
            "few": "норвежские кроны",
            "many": "норвежских крон",
            "other": "норвежской кроны"
        },
        "NPR": {
            "one": "непальская рупия",
            "few": "непальские рупии",
            "many": "непальских рупий",
            "other": "непальской рупии"
        },
        "NZD": {
            "one": "новозеландский доллар",
            "few": "новозеландских доллара",
            "many": "новозеландских долларов",
            "other": "новозеландского доллара"
        },
        "OMR": {
            "one": "оманский риал",
            "few": "оманских риала",
            "many": "оманских риалов",
            "other": "оманского риала"
        },
        "PAB": {
            "one": "панамский бальбоа",
            "few": "панамских бальбоа",
            "many": "панамских бальбоа",
            "other": "панамского бальбоа"
        },
        "PEN": {
            "one": "перуанский соль",
            "few": "перуанских соля",
            "many": "перуанских солей",
            "other": "перуанского соля"
        },
        "PGK": {
            "one": "кина Папуа – Новой Гвинеи",
            "few": "кины Папуа – Новой Гвинеи",
            "many": "кин Папуа – Новой Гвинеи",
            "other": "кины Папуа – Новой Гвинеи"
        },
        "PHP": {
            "one": "филиппинский песо",
            "few": "филиппинских песо",
            "many": "филиппинских песо",
            "other": "филиппинского песо"
        },
        "PKR": {
            "one": "пакистанская рупия",
            "few": "пакистанские рупии",
            "many": "пакистанских рупий",
            "other": "пакистанской рупии"
        },
        "PLN": {
            "one": "польский злотый",
            "few": "польских злотых",
            "many": "польских злотых",
            "other": "польского злотого"
        },
        "PYG": {
            "one": "парагвайский гуарани",
            "few": "парагвайских гуарани",
            "many": "парагвайских гуарани",
            "other": "парагвайского гуарани"
        },
        "QAR": {
            "one": "катарский риал",
            "few": "катарских риала",
            "many": "катарских риалов",
            "other": "катарского риала"
        },
        "RON": {
            "one": "румынский лей",
            "few": "румынских лея",
            "many": "румынских леев",
            "other": "румынского лея"
        },
        "RSD": {
            "one": "сербский динар",
            "few": "сербских динара",
            "many": "сербских динаров",
            "other": "сербского динара"
        },
        "RUB": {
            "one": "российский рубль",
            "few": "российских рубля",
            "many": "российских рублей",
            "other": "российского рубля"
        },
        "RWF": {
            "one": "франк Руанды",
            "few": "франка Руанды",
            "many": "франков Руанды",
            "other": "франка Руанды"
        },
        "SAR": {
            "one": "саудовский риял",
            "few": "саудовских рияла",
            "many": "саудовских риялов",
            "other": "саудовского рияла"
        },
        "SBD": {
            "one": "доллар Соломоновых Островов",
            "few": "доллара Соломоновых Островов",
            "many": "долларов Соломоновых Островов",
            "other": "доллара Соломоновых Островов"
        },
        "SCR": {
            "one": "сейшельская рупия",
            "few": "сейшельские рупии",
            "many": "сейшельских рупий",
            "other": "сейшельской рупии"
        },
        "SDG": {
            "one": "суданский фунт",
            "few": "суданских фунта",
            "many": "суданских фунтов",
            "other": "суданского фунта"
        },
        "SEK": {
            "one": "шведская крона",
            "few": "шведские кроны",
            "many": "шведских крон",
            "other": "шведской кроны"
        },
        "SGD": {
            "one": "сингапурский доллар",
            "few": "сингапурских доллара",
            "many": "сингапурских долларов",
            "other": "сингапурского доллара"
        },
        "SHP": {
            "one": "фунт острова Святой Елены",
            "few": "фунта острова Святой Елены",
            "many": "фунтов острова Святой Елены",
            "other": "фунта острова Святой Елены"
        },
        "SLL": {
            "few": "леоне",
            "many": "леоне",
            "other": "леоне"
        },
        "SOS": {
            "one": "сомалийский шиллинг",
            "few": "сомалийских шиллинга",
            "many": "сомалийских шиллингов",
            "other": "сомалийского шиллинга"
        },
        "SRD": {
            "one": "суринамский доллар",
            "few": "суринамских доллара",
            "many": "суринамских долларов",
            "other": "суринамского доллара"
        },
        "SSP": {
            "one": "южносуданский фунт",
            "few": "южносуданских фунта",
            "many": "южносуданских фунтов",
            "other": "южносуданского фунта"
        },
        "STN": {
            "one": "добра Сан-Томе и Принсипи",
            "few": "добры Сан-Томе и Принсипи",
            "many": "добр Сан-Томе и Принсипи",
            "other": "добры Сан-Томе и Принсипи"
        },
        "SYP": {
            "one": "сирийский фунт",
            "few": "сирийских фунта",
            "many": "сирийских фунтов",
            "other": "сирийского фунта"
        },
        "SZL": {
            "one": "свазилендский лилангени",
            "few": "свазилендских лилангени",
            "many": "свазилендских лилангени",
            "other": "свазилендского лилангени"
        },
        "THB": {
            "one": "таиландский бат",
            "few": "таиландских бата",
            "many": "таиландских батов",
            "other": "таиландского бата"
        },
        "TJS": {
            "one": "таджикский сомони",
            "few": "таджикских сомони",
            "many": "таджикских сомони",
            "other": "таджикского сомони"
        },
        "TMT": {
            "one": "новый туркменский манат",
            "few": "новых туркменских маната",
            "many": "новых туркменских манатов",
            "other": "нового туркменского маната"
        },
        "TND": {
            "one": "тунисский динар",
            "few": "тунисских динара",
            "many": "тунисских динаров",
            "other": "тунисского динара"
        },
        "TOP": {
            "one": "тонганская паанга",
            "few": "тонганские паанги",
            "many": "тонганских паанг",
            "other": "тонганской паанги"
        },
        "TRY": {
            "one": "турецкая лира",
            "few": "турецкие лиры",
            "many": "турецких лир",
            "other": "турецкой лиры"
        },
        "TTD": {
            "one": "доллар Тринидада и Тобаго",
            "few": "доллара Тринидада и Тобаго",
            "many": "долларов Тринидада и Тобаго",
            "other": "доллара Тринидада и Тобаго"
        },
        "TWD": {
            "one": "новый тайваньский доллар",
            "few": "новых тайваньских доллара",
            "many": "новых тайваньских долларов",
            "other": "нового тайваньского доллара"
        },
        "TZS": {
            "one": "танзанийский шиллинг",
            "few": "танзанийских шиллинга",
            "many": "танзанийских шиллингов",
            "other": "танзанийского шиллинга"
        },
        "UAH": {
            "one": "украинская гривна",
            "few": "украинские гривны",
            "many": "украинских гривен",
            "other": "украинской гривны"
        },
        "UGX": {
            "one": "угандийский шиллинг",
            "few": "угандийских шиллинга",
            "many": "угандийских шиллингов",
            "other": "угандийского шиллинга"
        },
        "USD": {
            "one": "доллар США",
            "few": "доллара США",
            "many": "долларов США",
            "other": "доллара США"
        },
        "UYU": {
            "one": "уругвайский песо",
            "few": "уругвайских песо",
            "many": "уругвайских песо",
            "other": "уругвайского песо"
        },
        "UZS": {
            "one": "узбекский сум",
            "few": "узбекских сума",
            "many": "узбекских сумов",
            "other": "узбекского сума"
        },
        "VES": {
            "one": "венесуэльский боливар",
            "few": "венесуэльских боливара",
            "many": "венесуэльских боливаров",
            "other": "венесуэльского боливара"
        },
        "VND": {
            "one": "вьетнамский донг",
            "few": "вьетнамских донга",
            "many": "вьетнамских донгов",
            "other": "вьетнамского донга"
        },
        "VUV": {
            "few": "вату Вануату",
            "many": "вату Вануату",
            "other": "вату Вануату"
        },
        "WST": {
            "one": "самоанская тала",
            "few": "самоанские талы",
            "many": "самоанских тал",
            "other": "самоанской талы"
        },
        "XAF": {
            "one": "франк КФА ВЕАС",
            "few": "франка КФА ВЕАС",
            "many": "франков КФА ВЕАС",
            "other": "франка КФА ВЕАС"
        },
        "XCD": {
            "one": "восточно-карибский доллар",
            "few": "восточно-карибских доллара",
            "many": "восточно-карибских долларов",
            "other": "восточно-карибского доллара"
        },
        "XOF": {
            "one": "франк КФА ВСЕАО",
            "few": "франка КФА ВСЕАО",
            "many": "франков КФА ВСЕАО",
            "other": "франка КФА ВСЕАО"
        },
        "XPF": {
            "one": "французский тихоокеанский франк",
            "few": "французских тихоокеанских франка",
            "many": "французских тихоокеанских франков",
            "other": "французского тихоокеанского франка"
        },
        "YER": {
            "one": "йеменский риал",
            "few": "йеменских риала",
            "many": "йеменских риалов",
            "other": "йеменского риала"
        },
        "ZAR": {
            "one": "южноафриканский рэнд",
            "few": "южноафриканских рэнда",
            "many": "южноафриканских рэндов",
            "other": "южноафриканского рэнда"
        },
        "ZMW": {
            "one": "замбийская квача",
            "few": "замбийские квачи",
            "many": "замбийских квач",
            "other": "замбийской квачи"
        }
    });
})();
